# 1) SQL QUERY FOR BOOKING & REVENUE

In [31]:
import pandas as pd
import sqlalchemy
import pymysql
import numpy as np
import calendar
import datetime
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT billing_cust_city, Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,
delivery_status,
COUNT(order_id) Bookings, 	
		
SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
   AND channel_user IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
   AND channel_user IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)AND channel_user IN (92),1,                                                                   
    0))))))) 'Allocated_count',
                          
SUM(IF((is_sample_collected = 1 AND channel_type=0),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
AND channel_type<>0 AND payed_amount>0),1,0))))) 'Picked_Orders', 

SUM(IF(delivery_status IN (3),1,0)) AS 'Cancelled_orders',

SUM(IF(delivery_status IN (13,26,27),1,0)) AS 'Rescheduled_OnHold_Orders',
                     
                     
                     SUM(IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
                         IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
                         IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
                         AND channel_type<>0 AND payed_amount>0),1,0)))) 'Picked Orders_B2B', 
                     

                   SUM(IF(ref_booking_id = 0 AND delivery_status IN (0,-1,3,13),order_price,IF(ref_booking_id = 0 
                       AND delivery_status NOT IN (0,-1,3,13),allocated_amount,0))) 'BOOKING_AMOUNT',
                   
                   
		   SUM(IF(DATE(order_date) < CURDATE(),IF(delivery_status IN (0,-1,3,13), order_price, 
		   IF(DATE(sample_collection_time) <= CURDATE(), allocated_amount, order_price)), 
		   IF(delivery_status NOT IN (0,-1,3),order_price,0))) AS 'booking_amount_New',
                     
                   
                   
                          SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
                          AND channel_user IN (92),99,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
                          AND channel_user IN (92),99,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)AND channel_user IN (92),99,                                                                   
                          0))))))) 'Allocated_amount',
                                    
                     
         
                     SUM(IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
                     IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0)))) 'Overall_Revenue',
                     
                     
                     SUM(IF((New_no = Old_no AND is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((New_no = Old_no AND is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue_Existing',
                     
                   
                     
                     SUM(IF(is_sample_collected = 1 AND channel_type=0, payed_amount,0)) 'Revenue_B2C',
                     
                     SUM(IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
                     IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Revenue_B2B',
                     
                     
                     SUM(IF((booked_from != 'phlebo_app' AND is_sample_collected=1
                     AND payed_amount > allocated_amount),payed_amount - allocated_amount,
                     IF((booked_from = 'phlebo_app' AND is_sample_collected=1),payed_amount,0))) 
                     'Phlebo_addon',

               
                     
                     SUM(IF(sample_collection_time > NOW()
                     AND delivery_status NOT IN (-1,0,1,3,13,18,23),order_price,0)) need_to_be_collected ,
                     SUM(Existing_cust_order_count) 'Existing_cust_order',
                     COUNT(DISTINCT c_order_id) 'customer_count'
                     
                     FROM (
                     SELECT X.billing_cust_tel 'Old_no',X1.billing_cust_tel 'New_no',
                     IF(X.billing_cust_tel = X1.billing_cust_tel,1,0)'Existing_cust_order_count',                     
                     X.is_sample_collected, X.sample_collecor_id,allocated_amount,billing_cust_city,
                     X.order_id, X.ref_booking_id,X.order_price, X.payed_amount, X.sample_collection_time, 
                     X.order_date, X.delivery_status,X.booked_from,X.created_by,X.channel_type,
                     X.Agent_name,X.Manager_Name,X.Dept_Name,DATE(X.sample_collection_time) 'Sample_Date',X1.Max_date,
                     X.cancelled_date,X.reshedule_date,
                     cancelled_after,reshedule_after,X.allocated_amount_new,X.allocated_count_new, X.c_order_id,X.channel_user
                                 
                     FROM
                     
                     (SELECT d.billing_cust_tel,d.is_sample_collected, d.sample_collecor_id,allocated_amount,billing_cust_city,
                     GROUP_CONCAT(DISTINCT u.contact_number), d.order_id, d.ref_booking_id,d.order_price, d.payed_amount, d.sample_collection_time, 
                     d.order_date, d.delivery_status,d.booked_from,d.created_by,d.channel_type,
                     IF(d.booked_from = 'crm',cu.name,IF(d.booked_from = 'phlebo_app',sc.name,0))
                     AS 'Agent_name',IF(d.booked_from = 'crm',cu1.name, IF(d.booked_from = 'phlebo_app',cu2.name,0)) AS 'Manager_Name',
                     IF(d.booked_from = 'crm',dm.dept_name,IF(d.booked_from='phlebo_app',dm1.dept_name,0)) AS 'Dept_Name',
                     camp_id,od.cancelled_date, d.reshedule_date,c_order_id,
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,0) 'cancelled_after',
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,0) 'reshedule_after',
                     
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),allocated_amount,0))) 'allocated_amount_new',
                          
                      IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),1,0))) 'allocated_count_new',d.channel_user
                     
                     FROM deal_order_management d 
                     LEFT JOIN deal_orders_child doc ON d.order_id = doc.order_id
                     LEFT JOIN order_details od ON doc.c_order_id = od.doc_id 
                     LEFT JOIN deal_user_management u ON doc.cust_id = u.user_id 
                    
                     LEFT JOIN crm_users AS cu ON d.created_by = cu.id
                     LEFT JOIN sample_collector sc ON d.created_by = sc.sid
                     LEFT JOIN crm_users AS cu1 ON cu1.id = cu.reporting_to
                     LEFT JOIN crm_users AS cu2 ON sc.supervisorID = cu2.id
                     LEFT JOIN dept_master AS dm ON dm.id = cu.dept_id
                     LEFT JOIN dept_master AS dm1 ON dm1.id = sc.dept_id
                     WHERE DATE(d.sample_collection_time) 
                     BETWEEN 
                     LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
                     AND 
                     curdate()
                     GROUP BY d.order_id) X
                     LEFT JOIN
                     (SELECT dom.billing_cust_tel, MAX(DATE(dom.sample_collection_time)) 'Max_date', COUNT(dom.order_id) FROM deal_order_management dom
                     WHERE DATE(dom.sample_collection_time) < LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY GROUP BY dom.billing_cust_tel) X1
                     ON X.billing_cust_tel = X1.billing_cust_tel GROUP BY X.order_id) X2
                     GROUP BY billing_cust_city,Sample_Date,Agent_name,dept_name'''
df_master = pd.read_sql_query(query,engine)
engine.dispose()
df_master.head()

,billing_cust_city,Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,delivery_status,Bookings,Allocated_count,Picked_Orders,...,booking_amount_New,Allocated_amount,Overall_Revenue,Overall_Revenue_Existing,Revenue_B2C,Revenue_B2B,Phlebo_addon,need_to_be_collected,Existing_cust_order,customer_count
0,Agra,2019-09-01,0,0,0,consumer_app,3,3,2.0,2.0,...,3877.0,2798.0,2898.0,0.0,2898.0,0.0,100.0,0.0,0.0,3
1,Agra,2019-09-01,Bhojraj,Krishan Kumar,Operations - Phlebo,phlebo_app,15,1,1.0,1.0,...,0.0,0.0,1649.0,0.0,1649.0,0.0,1649.0,0.0,0.0,1
2,Agra,2019-09-01,Deepak Kumar,Krishan Kumar,Operations - Phlebo,phlebo_app,15,1,1.0,1.0,...,0.0,0.0,1059.0,1059.0,1059.0,0.0,1059.0,0.0,1.0,1
3,Agra,2019-09-01,Lalit Yadav,Bhawna Anand,Outbound Sales,crm,13,1,1.0,0.0,...,1650.0,1650.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1
4,Agra,2019-09-01,Madhu yadav,Bhawna Anand,Outbound Sales,crm,26,1,1.0,0.0,...,998.0,998.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1

# 2) SQL QUERY FOR GROSS MARGIN

In [32]:

engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT x1.payed_amount,SUM(x2.lab_cost) sum_addon_cost,x1.sample_collection_time,x1.order_id,SUM(order_count) orders, 
x1.billing_cust_city,DATE(x1.sample_collection_time)
FROM

(SELECT dom1.order_id,
 IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
 IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
 IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0)))'payed_amount',

IF((is_sample_collected = 1 AND channel_type=0),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
AND channel_type<>0 AND payed_amount>0),1,0))))'order_count', 

sample_collection_time,billing_cust_city
FROM deal_order_management dom1
WHERE DATE(dom1.sample_collection_time) BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
AND 
curdate() 
AND dom1.is_sample_collected=1
GROUP BY dom1.order_id)x1
LEFT JOIN
(SELECT SUM(od.addon_cost)AS lab_cost,dom.payed_amount AS payed_amount,dom.sample_collection_time,dom.order_id, billing_cust_city, dom.booked_from,
 dom.allocated_amount,DATE(dom.sample_collection_time)
	
	FROM deal_order_management dom LEFT JOIN deal_orders_child doc ON dom.order_id = doc.order_id
LEFT JOIN order_details od ON doc.c_order_id = od.doc_id

WHERE od.id IS NOT NULL AND
dom.is_sample_collected = 1 AND 
dom.delivery_status NOT IN (-1,0,3,13) AND
(od.order_delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) OR  od.order_delivery_status IS NULL)
AND od.addon_flag !=-1 
AND DATE(dom.sample_collection_time) BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
AND 
curdate() 
AND (dom.role_id NOT IN (6,27) AND dom.created_by NOT IN (124,230,509))
GROUP BY dom.order_id) x2 ON x1.order_id = x2.order_id
GROUP BY x1.order_id'''
df_margin = pd.read_sql_query(query,engine)
engine.dispose()
df_margin.head()

,payed_amount,sum_addon_cost,sample_collection_time,order_id,orders,billing_cust_city,DATE(x1.sample_collection_time)
0,0,335.0,2019-09-05 07:00:00,1649327934,1.0,Delhi,2019-09-05
1,0,533.0,2019-09-07 10:00:00,1649973400,1.0,Mumbai,2019-09-07
2,0,1044.0,2019-09-11 07:00:00,1652703494,1.0,Delhi,2019-09-11
3,0,15.0,2019-09-04 09:30:00,1680377993,1.0,Ghaziabad,2019-09-04
4,0,1205.0,2019-09-08 07:00:00,1683613915,1.0,Delhi,2019-09-08

# 3) SQL QUERY FOR LEADS DATA

In [33]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT mas.city_check_final AS 'CITY', mas.Google_Facebook AS 'Leads_Tag',DATE(mas.xcreated) 'created_on',

COUNT(DISTINCT mas.lead_id) AS 'Leads' FROM 
(
SELECT  DISTINCT	 
	 IF(IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),
		IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))) IS NULL,LEFT(lal.utm_campaign,LOCATE('-',lal.utm_campaign)-1),
		  
		  IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))))	
		  AS city_check_final,
		  IF(lal.lead_source IN (3,4,118,122), "Premium leads","Non Premium leads") AS lead_tag,
		  IF(lal.lead_source = 3,"Facebook",IF(lal.lead_source IN (4,69,118,122),"Google",
		  IF(lal.lead_source IN (13,14,15,16,27,28,36,37,38,44,49,50,52,79,82,93,101,116),"SMS_Campaigns","Others")))'Google_Facebook',

lm.lead_id,dom.order_id,lal.lead_source,dc.city_name,DATE(lal.created_on) 'xcreated'
FROM lead_master AS lm
LEFT JOIN 
lead_activity_log AS lal ON lm.lead_id = lal.lead_id 
LEFT JOIN
deal_order_management AS dom ON dom.billing_cust_tel = lm.contact_number AND DATE(dom.order_date) >= DATE(lal.created_on)
LEFT JOIN
lead_source AS ls ON ls.id = lal.lead_source
LEFT JOIN
deal_city AS dc ON lal.lead_city = dc.city_id
LEFT JOIN
crm_users AS cu ON cu.id = lal.agent_id
WHERE DATE(lal.created_on) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 1 MONTH)) 
AND 
(CURDATE() - INTERVAL 1 day)
AND lal.is_new_interest=1) AS mas
GROUP BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)
ORDER BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)'''
df_lead = pd.read_sql_query(query,engine)
engine.dispose()
df_lead.head()

   CITY Leads_Tag  created_on  Leads
0  None  Facebook  2019-08-31     23
1  None  Facebook  2019-09-01     22
2  None  Facebook  2019-09-02     27
3  None  Facebook  2019-09-03     13
4  None  Facebook  2019-09-04     14

# 4) SQL QUERY FOR KIT COST

In [34]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT xdate, billing_cust_city, SUM(IF(bd = 'not_bd',custs,0)) 'NON_BD_customers'
FROM
(SELECT order_id, MIN(DATE(b1.sample_collection_time)) xmin, MAX(DATE(b1.sample_collection_time)) xmax, 
billing_cust_city, bd, COUNT(DISTINCT cust_id) custs, DATE(sample_collection_time) AS xdate
FROM
(SELECT d1.order_id, d1.cust_id, d.delivery_status, d.sample_collection_time, 
IF(d.billing_cust_city = 23,'Gurgaon',IF(d.billing_cust_city = 1595,'Delhi',d.billing_cust_city)) billing_cust_city, d.is_sample_collected, d.billing_cusT_name, d1.customer_name, d.payed_amount,
IF(d.channel_type = 0,'not_bd','bd') bd
FROM deal_order_management d
LEFT JOIN deal_orders_child d1
ON d.order_id = d1.order_id
WHERE DATE(d.sample_collection_time) BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
AND 
curdate() 
AND is_sample_collected = 1
AND d.delivery_status IN (7,8,9,12,15,21,23,18,26,25,27,28)) b1
GROUP BY order_id) b2
GROUP BY billing_cust_city, xdate
ORDER BY 'NON_BD_customers' DESC'''
df_kit = pd.read_sql_query(query,engine)
df_kit['kit_cost'] = df_kit['NON_BD_customers']*33.5
engine.dispose()
df_kit.head()

        xdate billing_cust_city  NON_BD_customers  kit_cost
0  2019-09-05             Delhi             326.0   10921.0
1  2019-09-07            Mumbai              78.0    2613.0
2  2019-09-11             Delhi             341.0   11423.5
3  2019-09-04         Ghaziabad              70.0    2345.0
4  2019-09-08             Delhi             410.0   13735.0

# 5) SQL QUERY FOR FACEBOOK COST

In [35]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT date(lcd.date_time) 'Lead_creation_date',SUBSTRING(lcd.campaign_name,3,LOCATE(',',lcd.campaign_name,1)-3)
AS 'city',ROUND(SUM(sms_rate),2) AS 'Facebook_cost' FROM `lead_campaign_detail` lcd 
WHERE lcd.vendor_id =3 AND DATE(Date_time)  BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 1 MONTH)) 
AND 
(CURDATE() - INTERVAL 1 day)
GROUP BY city,Lead_creation_date'''
df_FBcost = pd.read_sql_query(query,engine)
engine.dispose()
df_FBcost.head()

  Lead_creation_date  city  Facebook_cost
0         2019-08-31  AGRA        1935.99
1         2019-09-01  AGRA        2025.95
2         2019-09-02  AGRA        1855.24
3         2019-09-03  AGRA        1969.99
4         2019-09-04  AGRA        1931.43

# 6) SQL QUERY FOR GOOGLE COST

In [36]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT date(lcd.date_time) 'Lead_creation_date',SUBSTRING(lcd.campaign_name,1,LOCATE(':',lcd.campaign_name,1)-1) AS 'city',ROUND(SUM(sms_rate),2) AS 'Google_cost' 
FROM lead_campaign_detail lcd
WHERE lcd.vendor_id IN (4,69,118,122) AND DATE(Date_time) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 1 MONTH)) 
AND 
(CURDATE() - INTERVAL 1 day)
GROUP BY city,Lead_creation_date'''
df_Googlecost = pd.read_sql_query(query,engine)
engine.dispose()
df_Googlecost.head()

  Lead_creation_date city  Google_cost
0         2019-08-31           1782.57
1         2019-09-01           1513.68
2         2019-09-02           1095.87
3         2019-09-03           1136.80
4         2019-09-04           1181.31

# 7) SQL QUERY FOR CITY & STATE

In [37]:
%pwd
%cd D:\Raw_Data\City Vs State
df_city = pd.read_csv('city_vs_state.csv')

D:\Raw_Data\City Vs State

# 8) SQL QUERY FOR REFUND AMOUNT

In [38]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' SELECT city_name, Refund_month,SUM(refund) 'refund_amt'
FROM(
SELECT rp.booking_id,rp.created_at,rp.updated_at,rp.status,DATE(dom.sample_collection_time),SUM(rp.refund_amount) refund,
MONTHNAME(rp.transaction_date) Refund_month,rp.transaction_date,billing_cust_city city_name FROM refund_process rp 
LEFT JOIN deal_order_management dom ON dom.order_id = rp.booking_id
WHERE DATE(rp.transaction_date) 
BETWEEN LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
AND curdate()
AND rp.payment_status =1
GROUP BY rp.booking_id)x1
GROUP BY city_name,Refund_month'''
df_refund = pd.read_sql_query(query,engine)
engine.dispose()
df_refund.head()

       city_name Refund_month  refund_amt
0      Bengaluru    September      5727.0
1          Delhi    September     13760.0
2      Ghaziabad    September      2839.0
3  Greater Noida    September      1955.0
4        Gurgaon    September      2994.0

# 9) SQL QUERY FOR PHLEBO CONVEYANCE

In [39]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT scz.zone_name,SUM(optimal_distance_traveled),SUM(actual_distance_traveled), 
SUM(ROUND(actual_distance_traveled*2.5,0)) AS conveyance
FROM `phlebo_travel_report` AS ptr
LEFT JOIN sample_collector AS sc ON ptr.sample_collector_id = sc.sid
LEFT JOIN sample_collection_zone AS scz ON scz.zone_id = ptr.zone_id
WHERE travel_date BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
AND curdate()
GROUP BY scz.zone_name'''
df_conveyance = pd.read_sql_query(query,engine)
engine.dispose()
df_conveyance.head()

,zone_name,SUM(optimal_distance_traveled),SUM(actual_distance_traveled),conveyance
0,Agra,1239.617,1783.542,4457.0
1,ahmedabad,1428.941,1785.395,4463.0
2,Ambala,753.539,837.371,2093.0
3,Amritsar,1777.949,2928.628,7322.0
4,Bahadurgarh,459.917,792.502,1982.0

# 10) No. of days MTD & overall

In [40]:
now = datetime.datetime.now()
mtd_days=now.day
overall_days=calendar.monthrange(now.year, now.month)[1]

# 11) Booking & Revenue DETAILED

In [41]:
dfg2 = df_master.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfg3=dfg2.drop(columns = 'Lead_City')
dfg4=pd.DataFrame(dfg3.groupby(['State'])['Bookings'].sum())
dfg4.head()
dfg4.reset_index(inplace=True)

var = ['BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']
for num_var in var:
    dfg5=pd.DataFrame(dfg3.groupby(['State'])[num_var].sum())
    dfg4=pd.merge(dfg4,dfg5,left_on = 'State',right_on = 'State',how = 'inner')
    
dfg7=dfg4[['State','Bookings','BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']]

def var_sum(x):
    return pd.Series(np.sum(x))


dfg7 = dfg7._get_numeric_data().apply(lambda x : var_sum(x))

df_gross=pd.concat([dfg4,dfg7],sort=False)

df_gross['State'].fillna('Total',inplace = True)
df_gross

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon
0,Ahmedabad,109,132655.0,81.0,115100.0,16.0,26.0,64.0,107041.0,21545.0
1,BLR,1110,1268832.0,899.0,1172708.0,120.0,189.0,713.0,971880.0,62280.0
2,Dehradun,302,336169.0,262.0,301717.0,25.0,45.0,223.0,308568.0,64154.0
3,HR,251,275179.0,210.0,239565.0,22.0,35.0,166.0,246312.0,66583.0
4,Hyderabad,511,584543.0,416.0,509247.0,68.0,117.0,304.0,392642.0,14357.0
5,Jaipur,219,240941.0,192.0,227225.0,21.0,35.0,159.0,236699.0,63886.0
6,MP,229,297979.0,184.0,253826.0,41.0,40.0,144.0,199724.0,27329.0
7,Mumbai,1468,1833659.0,1075.0,1573259.0,268.0,337.0,826.0,1242868.0,105584.0
8,NCR,7437,8285613.0,6527.0,7723778.0,615.0,886.0,5630.0,7455999.0,1029397.0
9,PCM,421,540161.0,358.0,484733.0,42.0,61.0,291.0,427896.0,34189.0
10,Pune,701,825922.0,538.0,743162.0,101.0,171.0,416.0,628856.0,52728.0
11,Punjab,583,725859.0,516.0,656991.0,54.0,83.0,431.0,785435.0,249529.0
12,UP,1222,1331883.0,1025.0,1157730.0,102.0,189.0,897.0,1218376.0,269552.0
0,Total,14563,16679395.0,12283.0,15159041.0,1495.0,2214.0,10264.0,14222296.0,2061113.0

# 22) GROSS MARGIN DETAILED

In [42]:
df_margin['payed_amount']=df_margin['payed_amount'].apply(pd.to_numeric)

dfm2 = df_margin.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfm3=dfm2.drop(columns = 'Lead_City')
dfm4=pd.DataFrame(dfm3.groupby(['State'])['payed_amount'].sum())
dfm4.head()
dfm4.reset_index(inplace=True)

dfm5=pd.DataFrame(dfm3.groupby(['State'])['sum_addon_cost'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')
dfm5=pd.DataFrame(dfm3.groupby(['State'])['orders'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')

p=379178/overall_days*mtd_days
r=162293/overall_days*mtd_days

q_BLR=np.sum(dfm4.iloc[0:1,-1:])
q_BLR

q_HYD=np.sum(dfm4.iloc[3:4,-1:])
q_HYD

q_MP=np.sum(dfm4.iloc[5:6,-1:])
q_MP

cost_prop_BLR = np.sum(p*(q_BLR/(q_HYD+q_BLR)))
cost_prop_BLR

cost_prop_HYD = np.sum(p*(q_HYD/(q_HYD+q_BLR)))
cost_prop_HYD

cost_prop_MP = np.sum(r)
cost_prop_MP

dfm4['blr_cost']=dfm4['State'].apply(lambda x:cost_prop_BLR if x=='BLR' else cost_prop_HYD if x=='Hyderabad' else 
                                     cost_prop_MP if x=='MP' else 0.0) 
dfm4['Total_Cost']=dfm4['sum_addon_cost']+dfm4['blr_cost']
dfm4['Gross_Margin']=dfm4['payed_amount']-dfm4['Total_Cost']
dfm5=dfm4[['payed_amount', 'sum_addon_cost', 'orders', 'blr_cost',
        'Total_Cost', 'Gross_Margin']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfm5 = dfm5._get_numeric_data().apply(lambda x : var_sum(x))

dfm4=pd.concat([dfm4,dfm5],sort=False)
dfm4['State'].fillna('Total',inplace = True)

dfm4['Gross_Margin']=round(dfm4['Gross_Margin'],0)
dfm4['Gross_Margin/order']=round(dfm4['Gross_Margin']/dfm4['orders'],0)
dfm4['Gross_Margin%']=round(dfm4['Gross_Margin']/dfm4['payed_amount'],2)
dfm4['ASP']=round(dfm4['payed_amount']/dfm4['orders'],0)
df_margin_final=dfm4[['State','Gross_Margin','Gross_Margin/order','Gross_Margin%','ASP']]
df_margin_final

        State  Gross_Margin  Gross_Margin/order  Gross_Margin%     ASP
0   Ahmedabad       71133.0              1111.0           0.66  1673.0
1         BLR      697693.0               979.0           0.72  1363.0
2    Dehradun      199179.0               893.0           0.65  1384.0
3          HR      146140.0               880.0           0.59  1484.0
4   Hyderabad      186140.0               612.0           0.47  1292.0
5      Jaipur      141842.0               892.0           0.60  1489.0
6          MP       84248.0               585.0           0.42  1387.0
7      Mumbai      785453.0               951.0           0.63  1505.0
8         NCR     4674733.0               830.0           0.63  1324.0
9         PCM      264288.0               908.0           0.62  1470.0
10       Pune      388439.0               934.0           0.62  1512.0
11     Punjab      426276.0               989.0           0.54  1822.0
12         UP      786601.0               877.0           0.65  1358.0
0       Total     8852165.0               862.0           0.62  1386.0

# 33) LEADS DATA DETAILED

In [43]:
df_lead.dropna(axis=0,how = 'any').shape

dfl2 = df_lead.merge(df_city,left_on ='CITY',right_on = 'Lead_City', how = 'inner')
dfl3=dfl2.drop(columns = ['Lead_City'])
dfl3=dfl3.drop_duplicates(keep='last')

dfl4=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Facebook')].groupby(['State'])['Leads'].sum())
dfl4.reset_index(inplace=True)

dfl5=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Google')].groupby(['State'])['Leads'].sum())

dfl4=pd.merge(dfl4,dfl5,left_on = 'State',right_on = 'State', how = 'inner')
dfl4.rename(columns={'Leads_x':'Facebook','Leads_y':'Google'},inplace=True)

dfl6 = dfl4[['Facebook','Google']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfl6 = dfl6._get_numeric_data().apply(lambda x : var_sum(x))

df_lead_final=pd.concat([dfl4,dfl6],sort=False)
df_lead_final['State'].fillna('Total',inplace = True)
df_lead_final

        State  Facebook  Google
0   Ahmedabad       851       8
1         BLR      1648    1004
2    Dehradun       329     111
3          HR       336      84
4   Hyderabad      1204     621
5      Jaipur       466     126
6          MP      1031     152
7      Mumbai      5016     683
8         NCR      4539    2613
9         PCM       445     236
10       Pune      1186     410
11     Punjab      1373     172
12         UP      1758     383
0       Total     20182    6603

# 44) KIT COST DETAILED

In [44]:
dfk2 = df_kit.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfk3=dfk2.drop(columns = 'Lead_City')
dfk4=pd.DataFrame(dfk3.groupby(['State'])['kit_cost'].sum())
dfk4.head()
dfk4.reset_index(inplace=True)
dfk5 = dfk4[['kit_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfk5 = dfk5._get_numeric_data().apply(lambda x : var_sum(x))

df_kit_Final=pd.concat([dfk4,dfk5],sort=False)
df_kit_Final['State'].fillna('Total',inplace = True)
df_kit_Final

        State  kit_cost
0   Ahmedabad    3216.0
1         BLR   30351.0
2    Dehradun    9380.0
3          HR    8609.5
4   Hyderabad   13132.0
5      Jaipur    7035.0
6          MP    7504.0
7      Mumbai   37084.5
8         NCR  255772.5
9         PCM   14371.5
10       Pune   18659.5
11     Punjab   24622.5
12         UP   35644.0
0       Total  465382.0

# 55) FACEBOOK COST DETAILED

In [45]:
df_FBcost['city'].dropna(axis=0,inplace=True)
dfc1=df_FBcost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'inner')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].dropna(inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Facebook_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Facebook_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_fbcost_final=pd.concat([dfc2,dfc3],sort=False)
df_fbcost_final['State'].fillna('Total',inplace = True)
df_fbcost_final

        State  Facebook_cost
0   Ahmedabad       29923.45
1         BLR      253600.99
2    Dehradun       35754.09
3          HR       50731.97
4   Hyderabad      109090.79
5      Jaipur       49744.98
6          MP       71381.77
7      Mumbai      533097.16
8         NCR      624959.69
9         PCM       48155.75
10       Pune      178025.43
11     Punjab       46345.62
12         UP      201986.51
0       Total     2232798.20

# 66) GOOGLE COST DETAILED

In [46]:
df_Googlecost['city'].dropna(axis=0,inplace=True)
dfc1=df_Googlecost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].fillna('NCR',inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Google_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Google_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_Googlecost_final=pd.concat([dfc2,dfc3],sort=False)
df_Googlecost_final['State'].fillna('Total',inplace = True)
df_Googlecost_final

        State  Google_cost
0   Ahmedabad      1191.40
1         BLR    321887.15
2    Dehradun     35181.26
3          HR     16488.44
4   Hyderabad    172179.83
5      Jaipur     40302.01
6          MP     50681.57
7      Mumbai    220315.36
8         NCR    745891.23
9         PCM     69355.36
10       Pune    132710.01
11     Punjab     33868.81
12         UP    101351.95
0       Total   1941404.38

# 88) REFUND DETAILED

In [47]:
dfr2 = df_city.merge(df_refund,left_on ='Lead_City',right_on = 'city_name', how = 'left')

dfr2['refund_amt'].replace(np.NaN,0)
dfr3=dfr2.drop(columns = 'Lead_City')
dfr4=pd.DataFrame(dfr3.groupby(['State'])['refund_amt'].sum())
dfr4.reset_index(inplace=True)


dfr5 = dfr4[['refund_amt']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfr5 = dfr5._get_numeric_data().apply(lambda x : var_sum(x))

df_refund_Final=pd.concat([dfr4,dfr5],sort=False)
df_refund_Final['State'].fillna('Total',inplace = True)
df_refund_Final

        State  refund_amt
0   Ahmedabad         0.0
1         BLR      5727.0
2    Dehradun         0.0
3          HR         0.0
4   Hyderabad      4917.0
5      Jaipur         0.0
6          MP         0.0
7      Mumbai      6194.0
8         NCR     27120.0
9         PCM         0.0
10       Pune     12474.0
11     Punjab         0.0
12         UP      5376.0
0       Total     61808.0

# 99) PHLEBO CONVEYANCE DETAILED

In [48]:

dfc2 = df_city.merge(df_conveyance,left_on ='Lead_City',right_on = 'zone_name', how = 'left')

dfc2['conveyance'].replace(np.NaN,0)
dfc3=dfc2.drop(columns = 'Lead_City')
dfc4=pd.DataFrame(dfc3.groupby(['State'])['conveyance'].sum())
dfc4.reset_index(inplace=True)


dfc5 = dfc4[['conveyance']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc5 = dfc5._get_numeric_data().apply(lambda x : var_sum(x))

df_conveyance_Final=pd.concat([dfc4,dfc5],sort=False)
df_conveyance_Final['State'].fillna('Total',inplace = True)
df_conveyance_Final

        State  conveyance
0   Ahmedabad      4463.0
1         BLR     32587.0
2    Dehradun      8121.0
3          HR      9444.0
4   Hyderabad     22428.0
5      Jaipur      6865.0
6          MP      9416.0
7      Mumbai     54502.0
8         NCR    149050.0
9         PCM     13074.0
10       Pune     36891.0
11     Punjab     23771.0
12         UP     34968.0
0       Total    405580.0

# FINAL MERGING OF ALL DF

In [49]:
df_MTD_FINAL1 = pd.merge(df_gross,df_margin_final,left_on='State',right_on='State',how='left')

In [50]:
df_MTD_FINAL2=pd.merge(df_MTD_FINAL1,df_lead_final,left_on='State',right_on='State',how='left')

In [51]:
df_MTD_FINAL3=pd.merge(df_MTD_FINAL2,df_kit_Final,left_on='State',right_on='State',how='left')

In [52]:
df_MTD_FINAL4=pd.merge(df_MTD_FINAL3,df_fbcost_final,left_on='State',right_on='State',how='left')

In [53]:
df_MTD_FINAL5=pd.merge(df_MTD_FINAL4,df_Googlecost_final,left_on='State',right_on='State',how='left')

In [54]:
df_MTD_FINAL6=pd.merge(df_MTD_FINAL5,df_refund_Final,left_on='State',right_on='State',how='left')

In [55]:
df_MTD_FINAL7=pd.merge(df_MTD_FINAL6,df_conveyance_Final,left_on='State',right_on='State',how='left')
df_MTD_FINAL7

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon,...,Gross_Margin/order,Gross_Margin%,ASP,Facebook,Google,kit_cost,Facebook_cost,Google_cost,refund_amt,conveyance
0,Ahmedabad,109,132655.0,81.0,115100.0,16.0,26.0,64.0,107041.0,21545.0,...,1111.0,0.66,1673.0,851,8,3216.0,29923.45,1191.40,0.0,4463.0
1,BLR,1110,1268832.0,899.0,1172708.0,120.0,189.0,713.0,971880.0,62280.0,...,979.0,0.72,1363.0,1648,1004,30351.0,253600.99,321887.15,5727.0,32587.0
2,Dehradun,302,336169.0,262.0,301717.0,25.0,45.0,223.0,308568.0,64154.0,...,893.0,0.65,1384.0,329,111,9380.0,35754.09,35181.26,0.0,8121.0
3,HR,251,275179.0,210.0,239565.0,22.0,35.0,166.0,246312.0,66583.0,...,880.0,0.59,1484.0,336,84,8609.5,50731.97,16488.44,0.0,9444.0
4,Hyderabad,511,584543.0,416.0,509247.0,68.0,117.0,304.0,392642.0,14357.0,...,612.0,0.47,1292.0,1204,621,13132.0,109090.79,172179.83,4917.0,22428.0
5,Jaipur,219,240941.0,192.0,227225.0,21.0,35.0,159.0,236699.0,63886.0,...,892.0,0.60,1489.0,466,126,7035.0,49744.98,40302.01,0.0,6865.0
6,MP,229,297979.0,184.0,253826.0,41.0,40.0,144.0,199724.0,27329.0,...,585.0,0.42,1387.0,1031,152,7504.0,71381.77,50681.57,0.0,9416.0
7,Mumbai,1468,1833659.0,1075.0,1573259.0,268.0,337.0,826.0,1242868.0,105584.0,...,951.0,0.63,1505.0,5016,683,37084.5,533097.16,220315.36,6194.0,54502.0
8,NCR,7437,8285613.0,6527.0,7723778.0,615.0,886.0,5630.0,7455999.0,1029397.0,...,830.0,0.63,1324.0,4539,2613,255772.5,624959.69,745891.23,27120.0,149050.0
9,PCM,421,540161.0,358.0,484733.0,42.0,61.0,291.0,427896.0,34189.0,...,908.0,0.62,1470.0,445,236,14371.5,48155.75,69355.36,0.0,13074.0
10,Pune,701,825922.0,538.0,743162.0,101.0,171.0,416.0,628856.0,52728.0,...,934.0,0.62,1512.0,1186,410,18659.5,178025.43,132710.01,12474.0,36891.0
11,Punjab,583,725859.0,516.0,656991.0,54.0,83.0,431.0,785435.0,249529.0,...,989.0,0.54,1822.0,1373,172,24622.5,46345.62,33868.81,0.0,23771.0
12,UP,1222,1331883.0,1025.0,1157730.0,102.0,189.0,897.0,1218376.0,269552.0,...,877.0,0.65,1358.0,1758,383,35644.0,201986.51,101351.95,5376.0,34968.0
13,Total,14563,16679395.0,12283.0,15159041.0,1495.0,2214.0,10264.0,14222296.0,2061113.0,...,862.0,0.62,1386.0,20182,6603,465382.0,2232798.20,1941404.38,61808.0,405580.0

# Date & city wise Google leads

In [56]:
dfl3_google = dfl3[dfl3['Leads_Tag'] == 'Google'].pivot_table(index=['State'],columns=['created_on'],values='Leads',aggfunc=np.sum)
dfl3_google.reset_index()

def var_sum(x):
    return pd.Series(np.sum(x))


dfl3_g_sum = dfl3_google._get_numeric_data().apply(lambda x : var_sum(x))

dfl3_google=pd.concat([dfl3_google,dfl3_g_sum],axis=0,sort=False)

dfl3_google.reset_index(inplace=True)
dfl3_google.rename(columns = {'index' : 'State'},inplace=True)
dfl3_google.fillna(0, inplace = True)
dfl3_google.loc[dfl3_google.shape[0]-1,'State'] = 'Total'
dfl3_google

created_on,State,2019-08-31,2019-09-01,2019-09-02,2019-09-03,2019-09-04,2019-09-05,2019-09-06,2019-09-07,2019-09-08,2019-09-09,2019-09-10,2019-09-11,2019-09-12
0,Ahmedabad,2.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0,3.0
1,BLR,93.0,76.0,58.0,89.0,68.0,79.0,79.0,82.0,64.0,90.0,79.0,80.0,67.0
2,Dehradun,6.0,3.0,12.0,9.0,10.0,6.0,7.0,14.0,13.0,16.0,7.0,8.0,0.0
3,HR,4.0,4.0,10.0,6.0,7.0,9.0,9.0,9.0,5.0,5.0,5.0,3.0,8.0
4,Hyderabad,44.0,43.0,32.0,36.0,43.0,40.0,59.0,62.0,54.0,50.0,41.0,61.0,56.0
5,Jaipur,11.0,12.0,10.0,10.0,16.0,5.0,11.0,5.0,7.0,6.0,10.0,9.0,14.0
6,MP,13.0,18.0,6.0,10.0,10.0,11.0,9.0,14.0,15.0,16.0,12.0,12.0,6.0
7,Mumbai,51.0,45.0,45.0,45.0,44.0,44.0,43.0,50.0,48.0,68.0,72.0,67.0,61.0
8,NCR,208.0,154.0,201.0,227.0,183.0,206.0,199.0,217.0,150.0,232.0,237.0,214.0,185.0
9,PCM,22.0,17.0,12.0,26.0,17.0,11.0,14.0,21.0,19.0,19.0,28.0,19.0,11.0
10,Pune,37.0,29.0,30.0,33.0,20.0,27.0,30.0,39.0,32.0,40.0,33.0,27.0,33.0
11,Punjab,19.0,17.0,15.0,13.0,9.0,11.0,16.0,11.0,7.0,14.0,16.0,12.0,12.0
12,UP,18.0,36.0,23.0,28.0,23.0,25.0,31.0,33.0,26.0,38.0,36.0,29.0,37.0
13,Total,528.0,454.0,454.0,532.0,450.0,475.0,508.0,557.0,440.0,594.0,577.0,541.0,493.0

# Date & city wise Facebook leads

In [57]:
dfl3_fb = dfl3[dfl3['Leads_Tag'] == 'Facebook'].pivot_table(index=['State'],columns=['created_on'],values='Leads',aggfunc=np.sum)
dfl3_fb.reset_index()

def var_sum(x):
    return pd.Series(np.sum(x))


dfl3_fb_sum = dfl3_fb._get_numeric_data().apply(lambda x : var_sum(x))

dfl3_fb = pd.concat([dfl3_fb,dfl3_fb_sum],axis=0,sort=False)

dfl3_fb.reset_index(inplace=True)
dfl3_fb.rename(columns = {'index' : 'State'},inplace=True)
dfl3_fb.fillna(0, inplace = True)
dfl3_fb.loc[dfl3_fb.shape[0]-1,'State'] = 'Total'
dfl3_fb

created_on,State,2019-08-31,2019-09-01,2019-09-02,2019-09-03,2019-09-04,2019-09-05,2019-09-06,2019-09-07,2019-09-08,2019-09-09,2019-09-10,2019-09-11,2019-09-12
0,Ahmedabad,61,51,43,74,60,59,57,50,56,60,120,110,50
1,BLR,132,132,104,168,171,173,173,104,109,135,100,107,40
2,Dehradun,22,21,30,38,32,38,30,23,27,19,17,25,7
3,HR,34,27,28,36,34,24,24,20,21,24,22,25,17
4,Hyderabad,83,91,97,113,90,84,103,79,95,115,110,93,51
5,Jaipur,30,37,23,44,37,41,48,34,33,26,37,51,25
6,MP,47,65,61,119,75,96,97,116,93,82,65,59,56
7,Mumbai,293,304,302,541,446,467,500,386,390,429,386,363,209
8,NCR,415,415,434,527,463,466,430,309,271,228,240,204,137
9,PCM,39,33,34,46,47,45,27,41,30,24,31,28,20
10,Pune,90,79,92,113,108,105,115,96,84,101,79,79,45
11,Punjab,66,72,105,144,130,128,119,135,129,97,86,95,67
12,UP,117,134,128,165,163,154,162,145,118,142,106,136,88
13,Total,1429,1461,1481,2128,1856,1880,1885,1538,1456,1482,1399,1375,812

# Date & city wise Facebook cost

In [58]:
df_FBcost['city'].dropna(axis=0,inplace=True)
dffb1=df_FBcost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dffb1=dffb1.drop(columns = 'Lead_City')
dffb1['State'].dropna(inplace=True)

df_fc = dffb1.pivot_table(index=['State'],columns=['Lead_creation_date'],values='Facebook_cost',aggfunc=np.sum)
df_fc.reset_index()


def var_sum(x):
    return pd.Series(np.sum(x))


df_fbc_sum = df_fc._get_numeric_data().apply(lambda x : var_sum(x))

df_fc=pd.concat([df_fc,df_fbc_sum],axis=0,sort=False)
df_fc.reset_index(inplace=True)
df_fc.rename(columns = {'index' : 'State'},inplace=True)
df_fc.fillna(0, inplace = True)
df_fc.loc[df_fc.shape[0]-1,'State'] = 'Total'
df_fc

Lead_creation_date,State,2019-08-31,2019-09-01,2019-09-02,2019-09-03,2019-09-04,2019-09-05,2019-09-06,2019-09-07,2019-09-08,2019-09-09,2019-09-10,2019-09-12
0,Ahmedabad,1941.31,1996.49,1903.02,2019.48,2017.71,1974.70,2025.29,1995.26,1940.30,2203.04,4888.62,5018.23
1,BLR,24599.21,25301.49,24370.55,25066.49,25173.89,24758.28,24714.32,16525.27,16666.60,17193.51,17210.07,12021.31
2,Dehradun,2919.19,3047.59,3012.44,3028.32,2997.37,3000.14,2963.18,2940.93,3002.31,3035.30,3001.29,2806.03
3,HR,4355.04,4548.33,4496.99,4548.66,4506.09,4390.27,4437.37,3795.55,4022.26,4026.74,4021.41,3583.26
4,Hyderabad,9681.70,10032.23,9713.46,9841.23,10968.72,10646.61,10640.98,7791.97,7933.39,8081.10,7991.05,5768.35
5,Jaipur,3913.20,4045.14,3876.70,4038.76,4512.09,4472.78,4477.68,4410.31,4385.33,3675.37,4468.84,3468.78
6,MP,5877.20,6087.58,5946.86,6056.61,5949.31,5871.60,5996.22,5884.12,6027.88,5916.13,5955.36,5812.90
7,Mumbai,42083.13,43468.02,42411.69,46986.13,51365.24,51002.83,51631.25,37745.35,41274.31,44679.78,44561.42,35888.01
8,NCR,60588.55,63887.14,60406.25,59861.64,70040.69,68674.58,61946.48,37317.04,39873.69,37306.58,39511.89,25545.16
9,PCM,3901.92,4049.38,3911.71,4042.88,4018.52,4029.25,3965.80,3962.82,4033.02,3984.77,4032.93,4222.75
10,Pune,14854.52,15213.45,14548.19,15096.56,15163.74,14638.74,15189.02,15103.76,15012.59,15121.14,14664.38,13419.34
11,Punjab,992.65,0.00,2677.91,3815.71,4977.91,4758.14,4936.37,5197.05,5033.59,4816.49,4922.58,4217.22
12,UP,15952.49,16721.15,15975.01,16531.62,16072.86,18839.70,18723.56,17076.65,17535.63,17352.81,17655.13,13549.90
13,Total,191660.11,198397.99,193250.78,200934.09,217764.14,217057.62,211647.52,159746.08,166740.90,167392.76,172884.97,135321.24

# Date & city wise Google cost

In [59]:
df_Googlecost['city'].dropna(axis=0,inplace=True)
dfc1=df_Googlecost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].fillna('NCR',inplace=True)

df_gc = dfc1.pivot_table(index=['State'],columns=['Lead_creation_date'],values='Google_cost',aggfunc=np.sum)
df_gc.reset_index()


def var_sum(x):
    return pd.Series(np.sum(x))


df_gc_sum = df_gc._get_numeric_data().apply(lambda x : var_sum(x))

df_gc=pd.concat([df_gc,df_gc_sum],axis=0,sort=False)
df_gc.reset_index(inplace=True)
df_gc.rename(columns = {'index' : 'State'},inplace=True)
df_gc.fillna(0, inplace = True)
df_gc.loc[df_gc.shape[0]-1,'State'] = 'Total'
df_gc

Lead_creation_date,State,2019-08-31,2019-09-01,2019-09-02,2019-09-03,2019-09-04,2019-09-05,2019-09-06,2019-09-07,2019-09-08,2019-09-09,2019-09-10,2019-09-11,2019-09-12
0,Ahmedabad,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,1191.40
1,BLR,26308.10,21920.93,18248.17,24665.09,22517.60,27223.70,26760.80,24874.59,25185.87,27925.69,26422.35,28024.91,21809.35
2,Dehradun,2937.28,2032.79,2488.28,2687.25,3022.80,3147.23,2246.33,2832.85,2448.51,2929.49,3048.40,2951.99,2408.06
3,HR,2203.74,891.14,1596.39,1017.35,1469.63,1423.50,760.06,1146.97,845.22,1304.49,1327.41,879.80,1622.74
4,Hyderabad,14535.85,10127.73,9498.64,14968.98,12051.32,11819.59,13085.50,14206.96,12599.82,14958.75,15595.49,14081.27,14649.93
5,Jaipur,3549.32,2638.10,2600.97,3465.49,2586.96,2590.00,3287.38,2691.25,2386.10,3249.18,3639.02,3313.61,4304.63
6,MP,4364.05,4219.71,4093.45,3995.82,3685.52,4061.78,3988.68,3258.05,4284.98,4458.99,3656.32,3426.57,3187.65
7,Mumbai,17396.83,13651.47,15207.61,17555.92,15307.01,14392.69,14988.07,17949.86,15738.86,18813.03,19270.37,21235.50,18808.14
8,NCR,62125.96,53699.89,56559.10,63236.83,58694.90,54123.95,53594.45,54919.03,43854.34,56888.45,67538.03,61555.34,59100.96
9,PCM,6855.72,4012.66,5864.68,7440.35,5102.17,3617.69,4392.36,6716.04,5478.89,5168.14,6445.66,4757.94,3503.06
10,Pune,14273.40,9246.37,8643.27,11102.20,9145.07,9541.42,7731.33,11374.56,9667.66,11510.92,10517.92,9917.03,10038.86
11,Punjab,3229.39,3100.59,2203.88,2999.60,2140.41,2302.47,2470.43,2814.17,2041.97,2725.05,2786.65,2675.24,2378.96
12,UP,8424.05,9500.43,7964.33,7000.25,6876.23,7817.48,6875.13,7337.98,7367.65,8064.77,8054.81,6764.18,9304.66
13,Total,166203.69,135041.81,134968.77,160135.13,142599.62,142061.50,140180.52,150122.31,131899.87,157996.95,168302.43,159583.38,152308.40

In [60]:
from openpyxl import load_workbook
book = load_workbook('leads_summary.xlsx')
writer = pd.ExcelWriter('leads_summary.xlsx', engine='openpyxl')
writer.book = book
df_MTD_FINAL7.to_excel(writer,sheet_name="MTD",header='infer', index=False,startcol=0,startrow=0)
dfl3_fb.to_excel(writer,sheet_name="MTD",header='infer', index=False,startcol=0,startrow=17)
dfl3_google.to_excel(writer,sheet_name="MTD",header='infer', index=False,startcol=0,startrow=35)
df_fc.to_excel(writer,sheet_name="MTD",header='infer', index=False,startcol=0,startrow=53)
df_gc.to_excel(writer,sheet_name="MTD",header='infer', index=False,startcol=0,startrow=71)
writer.save()